Repository: tisfeng/Easydict
Catalog: Easydict/App/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fil, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, lo, lt, lv, mn_mong, ms, my, nb, nl, pl, pt, pt_br, ro, ru, sk, sl, sr_cyrl, sv, ta, te, th, tr, ug, uk, ur, vi, zh_hans, zh_hant

# service.codex_cli.reasoning_effort.minimal
source: Minimal
es: Mínimo
ja: 最小
sk: Minimálne
zh_hans: 最小
zh_hant: 最小

# service.codex_cli.reasoning_effort.xhigh
source: Extra High
es: Extra alto
ja: 非常に高い
sk: Veľmi vysoké
zh_hans: 极高
zh_hant: 極高

# service.codex_cli.risk_warning
source: Uses your local official Codex CLI. Availability may change in the future and may carry account or policy risk.
es: Usa tu CLI oficial local de Codex. La disponibilidad puede cambiar en el futuro y puede implicar riesgos para la cuenta o las políticas.
ja: ローカルの公式 Codex CLI を使用します。今後利用できなくなる可能性があり、アカウントやポリシー上のリスクを伴う場合があります。
sk: Používa tvoje lokálne oficiálne Codex CLI. Dostupnosť sa môže v budúcnosti zmeniť a môže niesť riziko pre účet alebo pravidlá.
zh_hans: 此服务使用你本机的官方 Codex CLI，未来可用性可能发生变化，并可能带来账号或政策风险。
zh_hant: 此服務使用你本機的官方 Codex CLI，未來可用性可能發生變化，並可能帶來帳號或政策風險。

# service.configuration.ali.access_key_id.title
source: AccessKey ID
es: ID de clave de acceso

# service.configuration.ali.access_key_secret.title
source: AccessKey Secret
es: Secreto de clave de acceso

# service.configuration.api_missing.tips %@
source: Currently using the Secret Key API type, but a certain Secret Key is empty. Please go to Settings > Service > %@, fill in the required configuration information, or switch API types.
es: Actualmente usando el tipo de API de clave secreta, pero una cierta clave secreta está vacía. Por favor, ve a Configuración > Servicio > %@, completa la información de configuración requerida, o cambia el tipo de API.
ja: 現在 Secret Key API タイプを使用していますが、いずれかの Secret Key が空です。設定 > サービス > %@ で必要な設定情報を入力するか、API タイプを切り替えてください。
sk: Aktuálne používaš typ Secret Key API, ale niektorý Secret Key je prázdny. Prejdi do Nastavenia > Služba > %@, vyplň požadované konfiguračné informácie alebo prepni typy API.
zh_hans: 当前正使用 Secret Key API 类型，但是某个 Secret Key 为空，请前往设置-服务-%@，填写相关配置信息，或切换 API 类型
zh_hant: 目前使用的是 Secret Key API 類型，但某個 Secret Key 為空。請前往設定 > 服務 > %@，填入必要的配置資訊，或切換 API 類型。

# service.configuration.api_picker.title
source: API Type
es: Tipo de API
ja: API タイプ
sk: Typ API
zh_hans: API 类型
zh_hant: API 類型

# service.configuration.baidu.app_id.title
source: App ID
es: ID de aplicación
sk: ID aplikácie
zh_hant: 應用程式 ID

# service.configuration.baidu.secret_key.title
source: Secret Key
es: Clave secreta

# service.configuration.bing.cookie.title
source: Cookie Key
es: Clave de cookie
ja: Cookie キー
zh_hant: Cookie 金鑰

# service.configuration.codex_cli.model.placeholder
source: Leave empty to use config.toml default
es: Déjalo vacío para usar el valor predeterminado de config.toml
ja: 空欄の場合は config.toml のデフォルトを使用
sk: Prázdne = predvolený z config.toml
zh_hans: 留空则使用 config.toml 默认
zh_hant: 留空則使用 config.toml 預設

# service.configuration.codex_cli.model.title
source: Model
es: Modelo
ja: モデル
zh_hans: 模型
zh_hant: 模型

# service.configuration.codex_cli.reasoning_effort.title
source: Reasoning Effort
es: Esfuerzo de razonamiento
ja: 推論の度合い
sk: Úroveň uvažovania
zh_hans: 思考程度
zh_hant: 思考程度

# service.configuration.custom_openai.enable_streaming.footnote
source: Disable if the endpoint does not support streaming responses.
es: Desactívalo si el endpoint no admite respuestas en streaming.
ja: エンドポイントがストリーミングレスポンスに対応していない場合は無効にしてください。
sk: Vypnite, ak koncový bod nepodporuje streamované odpovede.
zh_hans: 如果端点不支持流式响应，请关闭此选项。
zh_hant: 如果端點不支援串流回應，請關閉此選項。

# service.configuration.custom_openai.enable_streaming.title
source: Enable Streaming
es: Habilitar streaming
ja: ストリーミングを有効化
sk: Povoliť streamovanie
zh_hans: 启用流式传输
zh_hant: 啟用串流傳輸

# service.configuration.custom_openai.model.placeholder
source: Model name, use commas (,) to separate multiple models.
es: Nombre del modelo, usa comas (,) para separar múltiples modelos.
ja: モデル名。複数のモデルはカンマ (,) で区切ります。
sk: Názov modelu, použi čiarky (,) na oddelenie viacerých modelov.
zh_hans: 模型名字，多个模型使用逗号（,）分隔
zh_hant: 模型名稱，使用逗號（,）分隔多個模型。

# service.configuration.custom_openai.name.title
source: Custom Service Name
es: Nombre de servicio personalizado
ja: カスタムサービス名
sk: Názov vlastnej služby
zh_hans: 自定义服务名称
zh_hant: 自訂服務名稱

# service.configuration.custom_openai.supported_models.title
source: Supported Models
es: Modelos soportados
ja: 対応モデル
sk: Podporované modely
zh_hans: 支持的模型
zh_hant: 支援的模型

# service.configuration.deepl.auth_key.title
source: Auth Key
es: Clave de autenticación
zh_hant: 驗證金鑰

# service.configuration.deepl.authkey_first.title
source: Auth Key First
es: Clave de autenticación primero
ja: Auth Key を優先
sk: Najskôr Auth Key
zh_hans: 优先使用 Auth Key
zh_hant: 驗證金鑰优先

# service.configuration.deepl.authkey_only.title
source: Auth Key Only
es: Solo clave de autenticación
ja: Auth Key のみ
sk: Len Auth Key
zh_hans: 仅使用 Auth Key
zh_hant: 僅使用驗證金鑰

# service.configuration.deepl.endpoint.title
source: API Endpoint
es: Endpoint de API
ja: API エンドポイント
sk: API koncový bod
zh_hans: API 请求地址
zh_hant: API 端點

# service.configuration.deepl.translation.title
source: API Usage Priority
es: Prioridad de uso de API
ja: API 使用の優先順位
sk: Priorita využívania API
zh_hans: API 使用优先级
zh_hant: API 使用優先順序

# service.configuration.deepl.web_first.title
source: Web API first
es: API web primero
ja: Web API を優先
sk: Najskôr Web API
zh_hans: 优先使用 Web API
zh_hant: 優先使用網頁 API

# service.configuration.delete
source: Delete
es: Eliminar
ja: 削除
sk: Odstrániť
zh_hans: 删除
zh_hant: 刪除

# service.configuration.doubao.api_key.title
source: API Key
es: Clave API
ja: API キー

# service.configuration.doubao.model.title
source: Model
es: Modelo
ja: モデル
zh_hans: 模型
zh_hant: 模型

# service.configuration.duplicate
source: Duplicate
es: Duplicar
ja: 複製
sk: Duplikovať
zh_hans: 复制
zh_hant: 複製

# service.configuration.fetch_models.add
source: Add
es: Añadir
ja: 追加
sk: Pridať
zh_hans: 添加
zh_hant: 加入

# service.configuration.fetch_models.deselect_all
source: Deselect All
es: Deseleccionar todo
ja: すべて選択解除
sk: Zrušiť výber
zh_hans: 取消全选
zh_hant: 取消全選

# service.configuration.fetch_models.local_title
source: Fetch Local Models
es: Obtener modelos locales
ja: ローカルモデルを取得
sk: Načítať lokálne modely
zh_hans: 获取本地模型
zh_hant: 取得本地模型

# service.configuration.fetch_models.search
source: Search models
es: Buscar modelos
ja: モデルを検索
sk: Hľadať modely
zh_hans: 搜索模型
zh_hant: 搜尋模型

# service.configuration.fetch_models.select_all
source: Select All
es: Seleccionar todo
ja: すべて選択
sk: Vybrať všetko
zh_hans: 全选
zh_hant: 全選

# service.configuration.fetch_models.title
source: Fetch Models
es: Obtener modelos
ja: モデルを取得
sk: Načítať modely
zh_hans: 从云端获取模型
zh_hant: 從雲端取得模型

# service.configuration.niutrans.api_key.title
source: API Key
es: Clave API
ja: API キー
zh_hant: API 金鑰

# service.configuration.openai.api_key.title
source: API Key
es: Clave API
ja: API キー

# service.configuration.openai.dictionary.title
source: Dictionary
es: Diccionario
ja: 辞書
sk: Slovník
zh_hans: 查单词
zh_hant: 辭典

# service.configuration.openai.enable_custom_prompt.footnote
source: When custom prompt is enabled, the default translation, sentence analysis, and dictionary prompt will be disabled.
es: Cuando el prompt personalizado está habilitado, el prompt de traducción, análisis de oraciones y diccionario por defecto serán deshabilitados.
ja: カスタムプロンプトを有効にすると、デフォルトの翻訳・文章解析・辞書プロンプトは無効になります。
sk: Keď je povolená vlastná výzva, predvolený preklad, analýza viet a výzva slovníka budú zakázané.
zh_hans: 开启自定义 Prompt 时，会禁用默认的翻译、句子分析和查单词 Prompt。
zh_hant: 開啟自訂提示時，會禁用預設的翻譯、句子分析和查單字提示。

# service.configuration.openai.enable_custom_prompt.title
source: Enable Custom Prompt
es: Habilitar prompt personalizado
ja: カスタムプロンプトを有効化
sk: Povoliť vlastnú výzvu
zh_hans: 使用自定义 Prompt
zh_hant: 使用自訂 Prompt

# service.configuration.openai.endpoint.placeholder
source: The full request URL, for example https://api.openai.com/v1/chat/completions
es: La URL completa de la solicitud, por ejemplo https://api.openai.com/v1/chat/completions
ja: 完全なリクエスト URL（例: https://api.openai.com/v1/chat/completions）
sk: Celá URL adresa požiadavky, napr. https://api.openai.com/v1/chat/completions
zh_hans: 完整请求 URL，例如 https://api.openai.com/v1/chat/completions
zh_hant: 完整的請求 URL，例如 https://api.openai.com/v1/chat/completions

# service.configuration.openai.endpoint.title
source: API Endpoint
es: Endpoint de API
ja: API エンドポイント
sk: API koncový bod
zh_hans: API 请求地址
zh_hant: API 端點

# service.configuration.openai.hide_think_tag_content.title
source: Hide <think> Tag Content
es: Ocultar <think> Tag Content
ja: <think> タグの内容を非表示
sk: Skryť obsah <think> Tag
zh_hans: 隐藏 <think> 标签内容
zh_hant: 隱藏 <think> 標籤內容

# service.configuration.openai.model.title
source: Use Model
es: Usar modelo
ja: 使用モデル
sk: Použiť model
zh_hans: 使用模型
zh_hant: 使用模型

# service.configuration.openai.sentence.title
source: Sentence
es: Oración
ja: 文章
sk: Veta
zh_hans: 句子分析
zh_hant: 句子

# service.configuration.openai.system_prompt.placeholder
source: You are a helpful translation assistant.
es: Eres un asistente de traducción útil.
ja: あなたは役立つ翻訳アシスタントです。
sk: Si užitočným pomocníkom pri preklade.
zh_hans: 你是一个有用的翻译助手。
zh_hant: 你是一個有用的翻譯助手。

# service.configuration.openai.system_prompt.title
source: System Prompt
es: Prompt del sistema
ja: システムプロンプト
sk: Systémová výzva
zh_hans: 系统 Prompt
zh_hant: 系統 Prompt

# service.configuration.openai.temperature.title
source: Temperature
es: Temperatura
sk: Teplota
zh_hans: 温度
zh_hant: 溫度

# service.configuration.openai.translation.title
source: Translation
es: Traducción
ja: 翻訳
sk: Preklad
zh_hans: 翻译
zh_hant: 翻譯

# service.configuration.openai.usage_status_always_off.title
source: Always Off
es: Siempre apagado
ja: 常にオフ
sk: Vždy vypnuté
zh_hans: 始终关闭
zh_hant: 始終關閉

# service.configuration.openai.usage_status_always_on.title
source: Always On
es: Siempre encendido
ja: 常にオン
sk: Vždy zapnuté
zh_hans: 始终开启
zh_hant: 始終開啟

# service.configuration.openai.usage_status_default.title
source: Default
es: Predeterminado
ja: デフォルト
sk: Predvolené
zh_hans: 默认
zh_hant: 預設

# service.configuration.openai.usage_status.title
source: Usage Status
es: Estado de uso
ja: 使用状況
sk: Stav používania
zh_hans: 使用状态
zh_hant: 使用狀態

# service.configuration.openai.user_prompt.footnote
source: Supports the following environment variables: ${{queryText}}: Query text ${{queryFromLanguage}}: Query language ${{queryTargetLanguage}}: Target language ${{firstLanguage}}: User's first language Example: Translate the following ${{queryFromLanguage}} text into ${{queryTargetLanguage}}: ${{queryText}}
es: Soporta las siguientes variables de entorno: ${{queryText}}: Texto de consulta ${{queryFromLanguage}}: Idioma de origen ${{queryTargetLanguage}}: Idioma de destino ${{firstLanguage}}: Primer idioma del usuario Ejemplo: Traduce el siguiente texto de ${{queryFromLanguage}} a ${{queryTargetLanguage}}: ${{queryText}}
ja: 以下の環境変数をサポートしています: ${{queryText}}: クエリテキスト ${{queryFromLanguage}}: クエリ言語 ${{queryTargetLanguage}}: 対象言語 ${{firstLanguage}}: ユーザーの第一言語 例: 次の ${{queryFromLanguage}} のテキストを ${{queryTargetLanguage}} に翻訳してください: ${{queryText}}
sk: Podporuje nasledujúce premenné prostredia: ${{queryText}}: Text dotazu ${{queryFromLanguage}}: Jazyk dotazu ${{queryTargetLanguage}}: Cieľový jazyk ${{firstLanguage}}: Prvý jazyk používateľa Príklad: Prelož nasledujúci text ${{queryFromLanguage}} do ${{queryTargetLanguage}}: ${{queryText}}
zh_hans: 支持以下环境变量： ${{queryText}}: 查询文本 ${{queryFromLanguage}}: 查询语言 ${{queryTargetLanguage}}: 目标语言 ${{firstLanguage}}: 用户第一语言 例如：Translate the following ${{queryFromLanguage}} text into ${{queryTargetLanguage}}: ${{queryText}}
zh_hant: 支援以下環境變數： ${{queryText}}: 查詢文本 ${{queryFromLanguage}}: 查詢語言 ${{queryTargetLanguage}}: 目標語言 ${{firstLanguage}}: 使用者第一語言 例如：Translate the following ${{queryFromLanguage}} text into ${{queryTargetLanguage}}: ${{queryText}}

# service.configuration.openai.user_prompt.placeholder
source: Translate the following ${{queryFromLanguage}} text into ${{queryTargetLanguage}}: ${{queryText}}
es: Traducir el siguiente texto de ${{queryFromLanguage}} a ${{queryTargetLanguage}}: ${{queryText}}
ja: 次の ${{queryFromLanguage}} のテキストを ${{queryTargetLanguage}} に翻訳してください: ${{queryText}}
sk: Preložte nasledujúci text ${{queryFromLanguage}} do ${{queryTargetLanguage}}: ${{queryText}}
zh_hans: 将下面 ${{queryFromLanguage}} 的文本翻译成 ${{queryTargetLanguage}}: ${{queryText}}
zh_hant: 將下面 ${{queryFromLanguage}} 的文本翻譯成 ${{queryTargetLanguage}}: ${{queryText}}

# service.configuration.openai.user_prompt.title
source: User Prompt
es: Prompt del usuario
ja: ユーザープロンプト
sk: Uživatelská výzva
zh_hans: 用户 Prompt
zh_hant: 用戶 Prompt

# service.configuration.reasoning_effort.title
source: Reasoning Effort
es: Esfuerzo de razonamiento
ja: 推論の度合い
sk: Úroveň uvažovania
zh_hans: 思考程度
zh_hant: 思考程度

# service.configuration.tencent.secret_id.title
source: Secret ID
es: ID secreto

# service.configuration.tencent.secret_key.title
source: Secret Key
es: Clave secreta

# service.configuration.validate
source: Validate
es: Validar
ja: 検証
sk: Overenie
zh_hans: 验证
zh_hant: 驗證

# service.configuration.validation_fail
source: Validation failed 💔
es: Validación fallida 💔
ja: 検証に失敗しました 💔
sk: Overenie zlyhalo 💔
zh_hans: 验证失败 💔
zh_hant: 驗證失敗 💔

# service.configuration.validation_success
source: Validation success 🎉
es: Validación exitosa 🎉
ja: 検証に成功しました 🎉
sk: Overenie úspešné 🎉
zh_hans: 验证成功 🎉
zh_hant: 驗證成功 🎉

# service.configuration.validation_success.streaming_disabled
source: Streaming is not supported by this endpoint and has been auto-disabled.
es: Este endpoint no admite streaming y se ha desactivado automáticamente.
ja: このエンドポイントはストリーミングに対応していないため、自動的に無効化されました。
sk: Tento koncový bod nepodporuje streamovanie a bolo automaticky vypnuté.
zh_hans: 该端点不支持流式传输，已自动关闭。
zh_hant: 該端點不支援串流傳輸，已自動關閉。

# service.configuration.volcano.access_id.title
source: Access Key ID
es: ID de clave de acceso

# service.configuration.volcano.secret_key.title
source: Secret Access Key
es: Clave secreta de acceso

# service.mdict.button.import
source: Import Dictionary
es: Importar diccionario
ja: 辞書をインポート
sk: Importovať slovník
zh_hans: 导入词典
zh_hant: 匯入字典

# service.mdict.error.import_failed
source: Import Failed
es: Error al importar
ja: インポートに失敗しました
sk: Import zlyhal
zh_hans: 导入失败
zh_hant: 匯入失敗

# service.mdict.error.no_dictionaries
source: No MDict dictionaries are enabled. Please import dictionaries in the service settings.
es: No hay diccionarios MDict habilitados. Importa diccionarios en los ajustes del servicio.
ja: 有効な MDict 辞書がありません。サービス設定で辞書をインポートしてください。
sk: Žiadne MDict slovníky nie sú povolené.
zh_hans: 未启用任何 MDict 词典，请在服务设置中导入词典。
zh_hant: 未啟用任何 MDict 字典，請在服務設定中匯入字典。

# service.mdict.hint.no_dictionaries
source: No dictionaries imported. Tap + to import an MDX file.
es: No se importaron diccionarios. Pulsa + para importar un archivo MDX.
ja: 辞書がインポートされていません。+ をタップして MDX ファイルをインポートしてください。
sk: Žiadne slovníky. Kliknutím na + importujte súbor MDX.
zh_hans: 尚未导入任何词典，点击 + 导入 MDX 文件。
zh_hant: 尚未匯入任何字典，點擊 + 匯入 MDX 檔案。

# service.mdict.name
source: MDict Dictionary
es: Diccionario MDict
ja: MDict 辞書
sk: MDict Slovník
zh_hans: MDict 词典
zh_hant: MDict 字典

# service.mdict.section.dictionaries
source: Dictionaries
es: Diccionarios
ja: 辞書
sk: Slovníky
zh_hans: 词典列表
zh_hant: 字典清單

# service.reasoning_effort.high
source: High
es: Alto
ja: 高
sk: Vysoké
zh_hans: 高
zh_hant: 高

# service.reasoning_effort.max
source: Max
es: Máximo
ja: 最大
sk: Maximálne
zh_hans: 最大
zh_hant: 最大

# service.reasoning_effort.off
source: Off
es: Desactivado
ja: オフ
sk: Vypnuté
zh_hans: 关闭
zh_hant: 關閉

# setting.about
source: About
es: Acerca de
ja: 情報
sk: O aplikácii
zh_hans: 关于
zh_hant: 關於

# setting.about.acknowledgements
source: Acknowledgements
es: Agradecimientos
ja: 謝辞
sk: Díky
zh_hans: 致谢
zh_hant: 致謝

# setting.about.contributor_link
source: Contributors
es: Colaboradores
ja: 貢献者
sk: Prispeli
zh_hans: 贡献者
zh_hant: 貢獻者

# setting.advance.apple_offline_translation
source: Apple Offline Translation
es: Traducción sin conexión de Apple
ja: Apple オフライン翻訳
sk: Apple Offline Preklad
zh_hans: 苹果离线翻译
zh_hant: 蘋果離線翻譯

# setting.advance.apple_offline_translation_desc
source: Offline translation requires downloading languages on the device, which can be managed in "System Settings".
es: La traducción sin conexión requiere descargar idiomas en el dispositivo, que se pueden gestionar en "Configuración del Sistema".
ja: オフライン翻訳にはデバイスへの言語のダウンロードが必要で、「システム設定」で管理できます。
sk: Offline preklad vyžaduje stiahnutie jazykov do zariadenia, ktoré je možné spravovať v "Systémových nastaveniach".
zh_hans: 离线翻译需要在设备上下载语言，可通过“系统设置”管理下载语言。
zh_hant: 離線翻譯需要在設備上下載語言，可通過“系統設置”管理下載語言。

# setting.advance.auto_select_all_text_field_text
source: Auto Select All Text
es: Seleccionar automáticamente todo el texto
ja: すべてのテキストを自動選択
sk: Automaticky vybrať celý text
zh_hans: 自动选中所有文本
zh_hant: 自動選取所有文本

# setting.advance.auto_select_all_text_field_text_desc
source: If no text is currently selected in the text field, automatically select all text content during translate and replace operations
es: Si no hay texto seleccionado actualmente en el campo de texto, seleccionar automáticamente todo el contenido del texto durante las operaciones de traducción y reemplazo
ja: テキストフィールドで現在テキストが選択されていない場合、翻訳・置換操作時にすべてのテキストを自動的に選択します
sk: Ak nie je v poli aktuálne vybraný žiadny text, automaticky vybrať všetok obsah textu pri prekladových a nahrádzacích operáciách
zh_hans: 如果当前输入框中未选中文本，在翻译并替换操作时，允许自动全选文本内容
zh_hant: 如果當前輸入框中未選中文本，在翻譯並替換操作時，允許自動全選文本內容

# setting.advance.auto_show_query_icon
source: Auto show query icon after selecting text
es: Mostrar automáticamente el icono de consulta tras seleccionar texto
ja: テキスト選択後にクエリアイコンを自動表示
sk: Automaticky zobraziť ikonu prekladania po označení textu
zh_hans: 划词后自动显示查询图标
zh_hant: 選取文本後自動顯示查詢圖示

# setting.advance.auto_show_query_icon.condition.desc
source: Show the query icon only when the selected text language differs and the character count reaches this value.
es: Mostrar el icono de consulta solo cuando el idioma del texto seleccionado sea diferente y la cantidad de caracteres alcance este valor.
ja: 選択したテキストの言語が異なり、かつ文字数がこの値に達した場合のみクエリアイコンを表示します。
zh_hans: 仅当选中文本语言≠指定语言 且 字符数≥该值时显示查询图标。
zh_hant: 僅當選取文本語言≠指定語言 且 字元數≥該值時顯示查詢圖示。

# setting.advance.auto_show_query_icon.condition.language
source: Show only when selected text language is not
es: Mostrar solo cuando el idioma del texto seleccionado no sea
ja: 選択テキストの言語が次でない場合のみ表示
zh_hans: 仅当选中文本语言不是
zh_hant: 僅當選取文本語言不是

# setting.advance.auto_show_query_icon.condition.min_length
source: Minimum character length
es: Longitud mínima de caracteres
ja: 最小文字数
zh_hans: 最小字符长度
zh_hant: 最小字元長度

# setting.advance.automatically_remove_code_comment_symbols
source: When querying, automatically remove the code comment symbol "/*#" from the text.
es: Al consultar, eliminar automáticamente el símbolo de comentario de código "/*#" del texto.
ja: クエリ時に、テキストからコードコメント記号「/*#」を自動的に削除する。
sk: Pri dotazovaní sa automaticky odstráni symbol komentára kódu "/*#" z textu.
zh_hans: 查询时，自动移除文本中的代码注释符号「/*#」
zh_hant: 查詢時，自動移除文本中的代碼注釋符號「/*#」

# setting.advance.automatically_replace_newline_with_space
source: When querying, automatically replace the "newline" in the text with "space"
es: Al consultar, reemplazar automáticamente el "salto de línea" en el texto con "espacio"
ja: クエリ時に、テキスト内の「改行」を自動的に「スペース」に置き換える
sk: Pri dotazovaní automaticky nahraď "nový riadok" v texte "medzerou"
zh_hans: 查询时，自动将文本中的「换行符」替换为「空格」
zh_hant: 查詢時，自動將文本中的「換行符」替換為「空格」

# setting.advance.automatically_split_words
source: When querying, automatically split single word text into key_value —> key value
es: Al consultar, dividir automáticamente el texto de una sola palabra en clave_valor —> clave valor
ja: クエリ時に、単一の単語テキストを自動的に分割（key_value —> key value）
sk: Pri dotazovaní automaticky rozdeľ jednoduchý slovný text na key_value —> key value
zh_hans: 查询时，自动将单个单词文本分词为 key_value —> key value
zh_hant: 查詢時，自動將單個單詞文本分詞為 key_value —> key value

# setting.advance.click_icon_query_info
source: Query only when clicking select query icon (when main window hidden)
es: Consultar solo al hacer clic en el icono de consulta de selección (cuando la ventana principal está oculta)
ja: 選択クエリアイコンをクリックしたときのみクエリ（メインウィンドウ非表示時）
sk: Prekladať len po kliknutí na ikonu vyberania textu (pri skrytom hlavnom okne)
zh_hans: 点击划词查询图标时才查询（需隐藏主窗口）
zh_hant: 僅在點擊划詞查詢圖示時查詢（當主視窗隱藏時）

# setting.advance.default_tts_service
source: Default TTS Service
es: Servicio TTS por defecto
ja: デフォルトの TTS サービス
sk: Predvolená TTS služba
zh_hans: 默认 TTS 服务
zh_hant: 預設文字轉語音服務

# setting.advance.disable_tips_view
source: Disable Tips View
es: Deshabilitar Tips View
ja: ヒント表示を無効化
sk: Vypnúť zobrazovanie tipov
zh_hans: 关闭提示视图
zh_hant: 停用提示檢視

# setting.advance.enable_beta_feature
source: Enable Beta features
es: Habilitar funciones beta
ja: ベータ機能を有効化
sk: Zapnúť beta funkcie
zh_hans: 启用 Beta 特性
zh_hant: 啟用測試版功能

# setting.advance.enable_compatibility_replace
source: Compatibility Replace
es: Reemplazo de compatibilidad
ja: 互換置換
sk: Náhrada v režime kompatibility
zh_hans: 兼容模式替换
zh_hant: 相容模式取代

# setting.advance.enable_compatibility_replace_desc
source: When enabled, text replacement will use compatibility mode, which works better in certain applications.
es: Cuando está habilitado, el reemplazo de texto usará el modo de compatibilidad, que funciona mejor en ciertas aplicaciones.
ja: 有効にすると、テキスト置換が互換モードを使用し、一部のアプリでより適切に動作します。
sk: Ak je povolené, nahrádzanie textu bude používať režim kompatibility, ktorý funguje lepšie v niektorých aplikáciách.
zh_hans: 启用后，文本替换将使用兼容模式，在部分应用中更可靠。
zh_hant: 啟用後，文字取代將使用相容模式，在部分應用程式中更可靠。

# setting.advance.enable_force_get_selected_text
source: Enable Force Get Selected Text
es: Habilitar obtención forzada de texto seleccionado
ja: 強制的にテキストを取得を有効化
sk: Zapnúť vynútené získanie vybraného textu
zh_hans: 启用强制取词
zh_hant: 啟用強制取詞

# setting.advance.enable_force_get_selected_text_desc
source: Note: This may affect the clipboard content
es: Nota: Esto puede afectar el contenido del portapapeles
ja: 注意: クリップボードの内容に影響する場合があります
sk: Poznámka: Toto môže ovplyvniť obsah schránky.
zh_hans: 注意，这可能会影响剪贴板内容
zh_hant: 注意，這可能會影響剪貼板內容

# setting.advance.enable_http_server
source: Enable HTTP Server
es: Habilitar servidor HTTP
ja: HTTP サーバーを有効化
sk: Zapnúť HTTP server
zh_hans: 开启 HTTP 服务器
zh_hant: 啟用 HTTP 伺服器

# setting.advance.enable_ocr_text_normalization
source: Enable OCR Text Format Optimization
es: Habilitar optimización de formato de texto OCR
ja: OCR テキスト形式の最適化を有効化
sk: Zapnúť formátovanie textu OCR
zh_hans: 启用 OCR 文本格式优化
zh_hant: 啟用 OCR 文本格式優化

# setting.advance.enable_ocr_text_normalization_desc
source: The original OCR recognized text format may be incorrect. Enabling this option will optimize the recognized text format.
es: El formato del texto reconocido por OCR original puede ser incorrecto. Habilitar esta opción optimizará el formato del texto reconocido.
ja: OCR で認識された元のテキスト形式が正しくない場合があります。このオプションを有効にすると、認識されたテキスト形式を最適化します。
sk: Pôvodný formát rozpoznaného textu OCR môže byť nesprávny. Zapnutím tejto možnosti sa optimalizuje formát rozpoznaného textu.
zh_hans: OCR 原始识别文本格式可能有误，开启该选项后，将会对文本进行格式优化处理。
zh_hant: OCR 原始識別文本格式可能有誤，開啟該選項後，將會對文本進行格式優化處理。

# setting.advance.enable_remove_books_excerpt_info
source: When looking up text, remove Books excerpt copyright notice
es: Al buscar texto, eliminar el aviso de derechos de autor del extracto de Books
ja: テキスト検索時に、ブックの抜粋著作権表示を削除する
sk: Pri získavaní textu odstrániť informácie o autorských právach z výpisov z Books
zh_hans: 取词时，移除 Books 摘录中的版权信息
zh_hant: 取詞時，移除 Books 摘錄中的版權資訊

# setting.advance.enable_youdao_ocr
source: Youdao OCR recognition
es: Reconocimiento OCR de Youdao
ja: Youdao OCR 認識
sk: Youdao OCR rozpoznávanie
zh_hans: 有道 OCR 识别
zh_hant: 有道 OCR 辨識
